Revit 2027 API
Element.IsModifiable Property
 Identifies if the element is modifiable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsModifiable { get; }
Public ReadOnly Property IsModifiable As Boolean
	Get
public:
property bool IsModifiable {
	bool get ();
}
member IsModifiable : bool with get
Property Value
Boolean
Remarks
 This is not a permanent state. The value depends on the document state. For example, active edit modes can make IsModifiable false for many elements.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace